from aiogram import types
from textwrap import dedent
from loader import bot, dp, Commands


@dp.message_handler(commands=[Commands.HELP, Commands.START_BOT])
async def help_handler(message: types.Message):
    help_text = dedent(f"""<b>🎮 Дотримуйтесь цих кроків:</b>
1. 📱 Додайте цього бота до групи

2. 🎯 У групі створіть нову гру за допомогою /{Commands.NEW} або приєднайтеся до існуючої
запуск гри з /{Commands.JOIN}

3. 🚀 Після того, як приєднаються як мінімум два гравці, розпочніть гру за допомогою
/{Commands.START}
4. 🃏 Введіть тег бота у вікно чату і натисніть <b>пробіл</b>.
Ви побачите свої картки (деякі з них виділені сірим кольором),
будь-які додаткові параметри, такі як взяти карти, пас і <b>?</b>, щоб побачити
поточний стан гри. <b>сірі карти</b> - це ті, які
<b>неможливо кинути</b> в даний момент.
Натискайте на параметр, щоб виконати
обрану дію.
Гравці можуть приєднатися до гри, тільки якщо гра не запущена.
Щоб вийти з гри, використовуйте /{Commands.LEAVE}.


<b>📊 Статистика:</b>
/{Commands.STATS} - Переглянути вашу статистику ігор
/{Commands.ON_STATS} - Увімкнути збір статистики
/{Commands.OFF_STATS} - Вимкнути збір статистики

<b>⚙️ Інші команди (тільки творець гри):</b>
/{Commands.KILL} - Завершити гру
/{Commands.KICK} - Видалити гравця з гри
(Відповіддю на повідомлення користувача)""")

    await message.answer(help_text)
